{
  "project": "SecondBrain",
  "branchName": "ralph/table-improvements",
  "description": "Table View Improvements - Add card/grid view and content grouping capabilities",
  "userStories": [
    {
      "id": "US-001",
      "title": "Update URL schema and composable for view/group params",
      "description": "As a developer, I need the URL params and composable to support new view/group options before building the UI.",
      "acceptanceCriteria": [
        "Add 'view' param to tableParamsSchema (enum: 'table' | 'cards', default 'table')",
        "Add 'group' param to tableParamsSchema (enum: 'none' | 'type' | 'year' | 'author', default 'none')",
        "useContentTable exposes 'view' and 'groupBy' refs with URL sync",
        "Add groupItems(items, groupBy) pure function that returns { label: string, items: ContentItem[] }[]",
        "Add unit tests for groupItems function covering all group types",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": "Foundation story - schema and composable changes must come first. Group by year extracts from date field, group by author uses first author."
    },
    {
      "id": "US-002",
      "title": "Add view toggle component to filter bar",
      "description": "As a user, I want to switch between table and card views so I can choose the layout that works best.",
      "acceptanceCriteria": [
        "Add UButtonGroup with 'Table' and 'Cards' options to ContentTableFiltersBar",
        "Toggle buttons use appropriate icons (list icon for table, grid icon for cards)",
        "Clicking toggle updates URL param via useContentTable view ref",
        "Active view visually highlighted in toggle group",
        "View toggle preserves all other active filters",
        "Typecheck passes",
        "Verify in browser"
      ],
      "priority": 2,
      "passes": false,
      "notes": "Depends on US-001 for view param support."
    },
    {
      "id": "US-003",
      "title": "Add grouping dropdown to filter bar",
      "description": "As a user, I want to group content by a field so I can see related items together.",
      "acceptanceCriteria": [
        "Add USelectMenu dropdown to filter bar with options: None, Type, Year, Author",
        "Dropdown uses appropriate icon (layers icon)",
        "Selection updates URL param via useContentTable groupBy ref",
        "Default shows 'None' when no grouping active",
        "Grouping selection preserved when switching views",
        "Typecheck passes",
        "Verify in browser"
      ],
      "priority": 3,
      "passes": false,
      "notes": "Depends on US-001 for groupBy param support."
    },
    {
      "id": "US-004",
      "title": "Create ContentCardsGrid component for card view",
      "description": "As a user, I want to see content in a card grid layout so I can scan items visually.",
      "acceptanceCriteria": [
        "Create ContentCardsGrid.vue component",
        "Responsive grid: 1 column mobile, 2 tablet, 3 desktop using Tailwind grid",
        "Each card shows: title, type badge, author avatars (max 2), tags (max 3), date, rating",
        "Cards are clickable to navigate to content page",
        "Empty state matches table empty state message",
        "Typecheck passes",
        "Verify in browser"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Can reuse ContentCard.vue patterns if one exists, otherwise create minimal card design."
    },
    {
      "id": "US-005",
      "title": "Integrate card view into table page",
      "description": "As a user, I want the table page to show cards when card view is selected.",
      "acceptanceCriteria": [
        "Table page conditionally renders ContentCardsGrid when view='cards'",
        "Table page renders existing table when view='table'",
        "Switching views preserves current filters and pagination",
        "Loading and error states work for both views",
        "Typecheck passes",
        "Verify in browser"
      ],
      "priority": 5,
      "passes": false,
      "notes": "Depends on US-002 (toggle), US-004 (card component)."
    },
    {
      "id": "US-006",
      "title": "Render grouped table view with section headers",
      "description": "As a user, I want the table to show section headers when grouping is active.",
      "acceptanceCriteria": [
        "When groupBy is active, table renders items within collapsible section groups",
        "Section headers show group name and item count (e.g., 'Articles (12)')",
        "Items within each group maintain current sort order",
        "Empty groups are hidden",
        "Collapsible sections start expanded by default",
        "Typecheck passes",
        "Verify in browser"
      ],
      "priority": 6,
      "passes": false,
      "notes": "Depends on US-001 (groupItems function). May need to refactor table structure for grouped rows."
    },
    {
      "id": "US-007",
      "title": "Render grouped card view with section headers",
      "description": "As a user, I want cards organized under group headers so I can visually scan by category.",
      "acceptanceCriteria": [
        "When groupBy is active, ContentCardsGrid renders section headers above each group",
        "Section headers show group name and count",
        "Cards within each group flow in responsive grid",
        "Groups sorted appropriately: Type (alphabetically), Year (newest first), Author (alphabetically)",
        "Items with missing group field shown in 'Unknown' group",
        "Typecheck passes",
        "Verify in browser"
      ],
      "priority": 7,
      "passes": false,
      "notes": "Depends on US-001 (groupItems), US-004 (card component)."
    }
  ]
}
